Revit 2024 API
MacroManager.IsDocLvlMacro Method
 Indicates current Macro is document level
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public bool IsDocLvlMacro()
Visual Basic
Public Function IsDocLvlMacro As Boolean
Visual C++
public:
bool IsDocLvlMacro()
Return Value
 Returns true if is document level, false otherwise.
See Also
MacroManager Class
Autodesk.Revit.DB.Macros Namespace